Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་བཻ་ཌཱུརྱས་བཏབ་ན་སྔོན་བས་ཀྱང་ཤིན་ཏུ་འཚེར་ལ་འོད་གསལ་ཞིང་དང་བར་འགྱུར་རོ།
en: This is like when gold is adorned with beryl and it becomes clearer, purer, and brighter.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱིས་ཤིན་ཏུ་བརྟགས་པས་སྔོན་བས་ཀྱང་ཤིན་ཏུ་བྱང་ལ་འོད་གསལ་ཞིང་དང་བ་ཡིན་ཏེ། ཕྱི་ཕྱིར་ཞིང་ཡང་རབ་ཏུ་ཞི་བས་མི་འཕྲོགས་པར་འགྱུར་རོ།
en: “O jinaputras! In that same way the roots of goodness of the bodhisattva who is on the sixth bodhisattva bhūmi, Manifested, become purer, clearer, and brighter through the analysis of method, wisdom, and knowledge, and furthermore become indestructible peace.

source: ཟླ་བའི་འོད་ནི་སེམས་ཅན་གྱི་ལུས་ཀྱང་སིམ་པར་བྱེད་ལ། རླུང་གི་དཀྱིལ་འཁོར་ཆེན་པོ་བཞིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན།
en: to give an analogy, moonlight soothes the bodies of beings and cannot be destroyed by the four circles of the air.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་དགེ་བའི་རྩ་བ་དེ་དག་སྔོན་བས་ཀྱང་སེམས་ཅན་དུ་མའི་བསམ་པའི་ཉོན་མོངས་པ་འབར་བ་ཡང་ཞི་ཞིང་སིམ་པར་བྱེད་ལ། བདུད་ཀྱི་ལམ་གྱི་རྒྱུད་བཞིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན།
en: In that same way the roots of goodness of the bodhisattva mahāsattva who is on the sixth bodhisattva bhūmi, Manifested, pacify and soothe the fire of the kleśas in many quintillions of beings and cannot be destroyed by the activities of the four māras.

source: དེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of wisdom predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་ཞེས་བྱ་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པའོ།
en: “O jinaputras! That in brief is the bodhisattva bhūmi that is the sixth bodhisattva bhūmi, which is named Manifested.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགར་འགྱུར་ཏེ།
en: “The bodhisattva who is on that bhūmi usually becomes the deva king Sunirmita.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྷག་པའི་ང་རྒྱལ་ཞི་བར་བྱ་བ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན།
en: He is wise and powerful in pacifying pride in beings.

source: ཉན་པ་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་དྲི་བས་མི་འཕྲོགས་པ་ཡིན།
en: He is not impeded by questions from any śrāvaka.

source: དེ་སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་མཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར་ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར། བླ་ན་མེད་པར་འགྱུར།
en: “In whatever roots of goodness he accomplishes through generosity, kind words, actions that benefit others, and practicing what he preaches, he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རབ་ཏུ་འཐོབ་ཅིང་དེ་དག་ལ་མཉམ་པར་གཞོག་པ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའི་བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རྣམ་པར་འབྱེད་པ་དང་། ལུས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ་དེ་དག་གི་ལུས་སམ། འོད་དམ་རྫུ་འཕྲུལ་ལམ། མིག་གམ་སྤྱོད་ཡུལ་ལམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains and rests in a trillion samādhis, sees a trillion buddhas and knows their blessings, causes a trillion worlds to shake, goes to a trillion buddha realms, illuminates a trillion worlds, ripens a trillion beings, remains for a trillion eons, enters a trillion previous eons and a trillion future eons, opens a trillion Dharma doors, manifests a trillion bodies, and manifests each body having a retinue of a trillion bodhisattvas.

source: དབྱངས་སམ། སྤྱོད་པ་འམ། རྒྱན་ཏམ་བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །མཁས་པས་ལམ་གྱི་སྤྱོད་པ་ལྔ་པོར་ཡོངས་རྫོགས་ནས།
en: “The wise who have completed the practice of the path through the five bhūmis And have meditated on the absence of features in phenomena, the absence of characteristics,

source: །ཆོས་རྣམས་མཚན་མེད་མཚན་ཉིད་མེད་དང་མ་སྐྱེས་དང་། །མ་བྱུང་སྔ་ནས་ཡོངས་སུ་ཞི་ཞིང་སྤྲོས་མེད་པ།
en: The absence of birth, the absence of production, primordial purity, and the absence of elaboration—

source: །ཡོངས་སུ་བསྒོམ་པས་ཡེ་ཤེས་བློ་ཅན་དྲུག་པ་གནོན།
en: With wisdom and understanding they ascend to the sixth bhūmi. “Without attachment, grasping, and conceptuality toward phenomena

source: །ཆོས་རྣམས་དབེན་ཞིང་ལེན་མེད་རྣམ་པར་རྟོག་མེད་དང་། །སྒྱུ་མའི་རང་བཞིན་གཉིས་ཀའི་དངོས་ལམ་རྣམ་གྲོལ་བས།
en: That have the nature of illusion and are devoid of the two kinds of being,

source: །ཆོས་ཀྱི་ཚུལ་ལ་འགལ་མེད་རྗེས་སུ་འཐུན་བྱེད་ཅིང་།
en: Being in accord with and not contradicting the nature of phenomena,

source: །ཡེ་ཤེས་ལྡན་པའི་དམ་པ་དྲུག་པ་ཡོངས་སུ་གནོན།
en: They who possess wisdom ascend to the excellent sixth bhūmi.

source: །འཐུན་པ་རྣོ་ལ་གནས་ཤིང་ཡེ་ཤེས་སྟོབས་ལྡན་པ།
en: “They remain in sharp concord and possess the power of wisdom.

source: །འཇིག་རྟེན་ཀུན་གྱི་འབྱུང་དང་འཇིག་ལ་རབ་ཏུ་རྟོག །གཏི་མུག་མུན་པས་འགྲོ་བ་འབྱུང་བ་ཀུན་ཏུ་སྐྱེད།
en: They regard the arising and destruction of all worlds. Origination from the darkness of ignorance is the nature of the creation of beings;

source: །གཏི་མུག་དེ་ཉིད་བྲལ་བས་འབྱུང་བ་མེད་པ་ཡིན།
en: When there is the cessation of ignorance it does not occur.

source: །རྐྱེན་གྱི་རྣམ་པ་དོན་དམ་སྟོང་པར་རྣམ་པར་འབྱེད།
en: “They discern that the formation of conditions is ultimately empty.

source: །བྱ་བ་མི་འགལ་རྒྱུ་རྐྱེན་བྱེད་པ་མཉམ་པར་ཤེས།
en: They know the equality of actions, causes, and conditions, which is not contrary to action.

source: །ཡང་དག་ཇི་བཞིན་བྱེད་པ་མེད་པར་ལས་ཤེས་ནས།
en: Knowing perfectly that actions do not have a doer,

source: །འདུས་བྱས་སྤྲིན་སྡུག་ལྟ་བུར་བྱེད་པ་མེད་པར་ཤེས།
en: They observe composite phenomena to be like massed clouds, devoid of action.

source: །བདེན་པ་མི་ཤེས་དེ་ནི་ཡང་དག་མ་རིག་པ།
en: “Not knowing the truth, ignorant of the ultimate,

source: །ལས་ནི་སེམས་ཀྱི་སྟོབས་ཀྱིས་མགོ་རྨོངས་བྱུང་བར་གྱུར།
en: There is karma through the power of the mind and the creation of division.

source: །སེམས་ལ་རྟེན་ཏེ་ལྷན་ཅིག་བྱུང་བ་མིང་དང་གཟུགས། །དེ་ལྟར་སྡུག་བསྔལ་ཕུང་པོ་ཆེན་པོའི་བར་དུ་འབྱུང་།
en: Based on the mind there is connate name-and-form and so on, Until the arising of the great aggregation of suffering.

source: །ཁམས་གསུམ་སེམས་ཀྱི་རྒྱུ་ལས་བྱུང་བར་དེ་འཇུག་སྟེ།
en: “They overcome the three realms as being ‘mind only.’

source: །སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་འདི་དག་སེམས་གཅིག་རྟེན།
en: These twelve components of becoming are in a single mind.

source: །འདོད་ཆགས་སྐྱེས་པ་དེ་ལས་སེམས་སུ་བརྗོད་པ་ཡིན།
en: They are born from desire; they are the manifestation of the mind.

source: །དེ་བཞིན་སྲིད་པའི་དངོས་པོ་སེམས་ཀྱི་རྣམ་པའོ།
en: Thus, creation and destruction also are aspects of the mind.

source: །མ་རིག་བྱ་བ་གཉིས་བྱེད་རྨོངས་པའི་དངོས་པོ་ལ།
en: “Ignorance has two effects:

source: །རྨོངས་པར་བྱས་ཤིང་དེ་ནས་སེམས་པའི་རྒྱུ་ཡང་འབྱིན།
en: it creates a state of delusion, And it also provides the cause for mentation

source: །དེ་བཞིན་རྒ་བ་ཕུང་པོ་གཞིག་བྱ་འཇིག་བྱེད་པར།
en: And so on, up till aging, destruction, and the breaking apart of the skandhas,

source: །དེ་ལས་སྡུག་བསྔལ་མིང་ཐོགས་ཐམས་ཅད་མི་ཟད་འབྱུང་།
en: And thus the entirety of all suffering that has no cessation.

source: མ་རིག་རྐྱེན་གྱིས་ཆད་པར་འགྱུར་བ་ཡོད་པ་མ་ནི།
en: “Ignorance as a condition is uninterrupted, But when there is the absence of creation there is cessation.

source: །རྣམ་པར་ཆད་ཅིང་རྒྱུ་རྐྱེན་བྲལ་བས་ཡོད་པ་འགག །གཏི་མུག་སྲེད་པ་ཉེར་ལེན་ཉོན་མོངས་ལམ་ཡིན་ཏེ།
en: Ignorance, craving, and grasping are the path of the kleśas.

source: །ལས་དང་སྲིད་པ་སེམས་པ་ལྷག་མ་སྡུག་བསྔལ་ཡིན།
en: Actions and becoming are mentation, and the rest are suffering.

source: །གཏི་མུག་སྐྱེ་མཆེད་བར་དུ་འདུས་བྱས་སྡུག་བསྔལ་ཏེ།
en: “Ignorance up to the sensory bases are the suffering of composite phenomena.

source: །རེག་དང་ཚོར་བ་དེ་དག་སྡུག་བསྔལ་སྡུག་བསྔལ་ཡིན།
en: Contact and sensation are the suffering of suffering.

source: །ཡན་ལག་ལྷག་མ་འགྱུར་བའི་སྡུག་བསྔལ་རྣམས་འཕེལ་བ།
en: The remaining components increase the suffering of change.

source: །བདག་མེད་ཤེས་པས་སྡུག་བསྔལ་གསུམ་པོ་འཆད་པར་འགྱུར།
en: By knowing selflessness the three sufferings are ended.

source: །མུན་པ་སེམས་དང་འདུས་བྱས་འདི་ནི་སྔོན་ལྟས་ཡིན།
en: “The mind in darkness and the formations take place in the past.

source: །རྣམ་པར་ཤེས་ནས་ཚོར་བའི་རྒྱུད་ཏུ་ད་ལྟར་བྱུང་།
en: Consciousness and so on, up to sensation, occur in the present.

source: །སྲེད་དང་སྲིད་པར་སྡུག་བསྔལ་འབྱུང་བ་ཕྱི་མའི་མཐའ།
en: Craving, becoming, and suffering arise in the future.

source: །འགགས་ཤིང་ཟད་པ་དེ་དག་ལྟ་བ་ཆད་པ་ཡིན།
en: Observing this is the cessation of their connection and continuity.

source: གཏི་མུག་རྐྱེན་གྱིས་དེ་དག་རྣམ་པར་འབྲེལ་བ་འབྱུང་།
en: “Ignorance as a condition gives rise to bondage.

source: །ཟད་པས་བྱང་ཆུབ་རྐྱེན་རྣམས་རྣམ་པར་འབྲེལ་བ་ཡིན།
en: Freedom from bondage is the cessation of conditions.

source: །རྒྱུ་ལས་རྒྱུ་འབྱུང་མེད་ན་རྒྱུ་ཡི་རྒྱུན་ཆད་འགྱུར།
en: The source of arising is a cause; it is not without a cause.

source: །བདེ་ཕན་ཤེས་ལྡན་རང་བཞིན་སྟོང་པ་དེ་ལྟར་རྟོག །རྒྱུད་དུ་འཐུན་པ་གཏི་མུག་མུན་ལས་བྱུང་བ་ཡིན།
en: The wisdom of the jinas observes the empty nature. “There is coming into existence through the process of generation from ignorance.

source: །མི་འཐུན་བཟློག་པ་གཏི་མུག་ཟད་པས་མི་འབྱུང་བའོ།
en: All coming into existence ceases through the negation that destroys the cause.

source: །ཟབ་པའི་རྐྱེན་དང་དེ་དག་ཡོད་དང་མེད་པ་ལས།
en: As a result of the profound conditions existing or not existing,

source: །གནས་པ་མེད་བློ་རྣམ་པ་བཅུར་ནི་དེ་ལྟར་རྟོག །སྲིད་པའི་ཡན་ལག་མཚམས་དང་སེམས་གཅིག་ལས་འཐུན་དང་། །ཆེད་དུ་མི་བྱེད་རྒྱུད་གསུམ་རྗེས་འབྲང་སྔོན་མཐའ་དང་། །སྡུག་བསྔལ་གསུམ་དང་རྒྱུས་བྱུང་སྐྱེ་དང་འཇིག་པ་དང་། །སྲིད་པའི་མཐར་ཕྱིན་ཟད་དང་རྐྱེན་གྱི་ལུགས་འཐུན་པར།
en: Ten aspects are observed by the nondwelling mind: “(1) One mind, ( ) the connection of the components of coming into existence, (3) The stages of activity, (4) inseparability, (5) three processes, (6) the past, (7) The three sufferings, (8) the causes of arising, (9) generation and elimination, (10) The cessation that is the conclusion of becoming, and the development that is the result of conditions.

source: །དེ་ལྟར་རྟེན་འབྲེལ་འབྱུང་ལ་ཡང་དག་འཇུག་བྱེད་པས།
en: “In that way they comprehend dependent origination,

source: །སྒྱུ་འདྲ་ཡང་དག་མ་ཡིན་ཚོར་བར་བྱེད་མེད་ཅིང་།
en: Which is like apparitions, untrue, without sensation or action,

source: །རྨི་ལམ་འདྲ་བ་དེ་བཞིན་མིག་ཡོར་འདྲ་བ་སྟེ།
en: Like dreams and similarly like illusions,

source: །བྱིས་པ་བསླུ་བའི་སྨིག་རྒྱུ་རང་བཞིན་མཚུངས་མཉམ་པ།
en: And like the optical illusions seen by ignorant, childlike beings.

source: །དེ་ལྟར་བསྒོམ་པ་མཁས་པའི་སྟོང་པ་ཉིད་ཀྱི་སྒོ།
en: “Those who meditate in that way have the emptiness of the wise.

source: །རྐྱེན་རྣམས་མེད་པ་དེ་ནི་མཚན་མ་མེད་པ་སྟེ།
en: That absence of conditions is featurelessness;

source: །ལོག་པར་ཤེས་པས་ནམ་ཡང་སྨོན་པ་མེད་པ་ཡིན།
en: Knowing that what appears is unreal, there is no aspiration,

source: །གཞན་དུ་སེམས་ཅན་སྙིང་བརྩེའི་དོན་དུ་སྐྱེ་བ་འཛིན།
en: Yet they take birth because of their compassion for beings.

source: །དེ་འདྲའི་རྣམ་ཐར་སྒོ་ལ་སྒོམ་བྱེད་མཐུ་ཆེ་བ།
en: “In that way the doors to liberation are meditated upon by those great beings.

source: །སྙིང་བརྩེའི་བློ་ལྡན་སངས་རྒྱས་ཡོན་ཏན་མངོན་འདོད་ཅིང་།
en: The compassion in their minds increases, and they desire the qualities of buddhahood.

source: །འདུས་བྱས་འདུས་པ་མཁས་པ་ཡོངས་སུ་རྟོག་བྱེད་པས།
en: They observe that composite phenomena are created through aggregation.

source: །བསམ་པ་ངེས་ཤིང་གཅིག་མིན་ལེགས་དང་ལྡན་པ་ཡིན།
en: There is definite motivation, and they possess numerous qualities.

source: །སྟོང་ཉིད་ཏིང་འཛིན་སྟོང་ཕྲག་བཅུ་རྣམས་ཡོངས་སུ་རྒྱས།
en: “They accomplish ten thousand emptiness samādhis,

source: དེ་བཞིན་བརྟན་པ་མཚན་མ་མེད་དང་སྨོན་མེད་ལྡན།
en: And likewise the absence of features and aspirationlessness.

source: །ཤེས་རབ་ཤས་ཆེ་འཐུན་པའི་བཟོད་པ་མཆོག་ཅན་ཏེ།
en: They have greater wisdom and supreme concordant patience.

source: །མཁས་པའི་རྣམ་ཐར་ཡེ་ཤེས་ཆགས་པ་མེད་དང་ལྡན།
en: They have the liberation of the wise and possess unimpeded wisdom.

source: །དེ་འདྲའི་བསམ་པས་དྲང་སྲོང་ཆེ་མང་མཆོད་བྱེད་པས།
en: “With that motivation they make offerings to a multitude of sages.

source: །རྒྱལ་བའི་བསྟན་པ་འདི་ལ་ཤིན་ཏུ་བསྔགས་པ་ཡིན།
en: They greatly praise this teaching of the Jina.

source: །དེ་ནི་སངས་རྒྱས་མཛོད་ཐོབ་ཁོང་དུ་ཆུད་པས་ན།
en: They obtain the treasure of the buddhas and fully accomplish it.

source: །བཻ་ཌཱུཪྻས་བཏབ་གསེར་མཆོག་བཞིན་དུ་སྔོན་བས་གསལ།
en: Like gold adorned by beryls they become even brighter than before.

source: །ཟླ་བའི་འོད་ནི་འགྲོ་བའི་ལུས་ལ་སིམ་པར་བྱེད།
en: “The light of the moon soothes the bodies of beings.

source: །རླུང་བཞི་ལངས་པས་ཡོངས་སུ་འཕྲོགས་པར་མི་ནུས་སོ།
en: Though the four winds rise they cannot take it away.

source: །རྒྱལ་སྲས་འོད་ཀྱང་བདུད་ཀྱི་ལམ་ལས་ཤིན་ཏུ་འདས།
en: The light of the bodhisattvas transcends the path of the māras,

source: །ཉོན་མོངས་ཡོངས་སུ་གདུང་དང་སྡུག་བསྔལ་ནད་ཀྱང་སེལ།
en: Eliminating the pain of the kleśas and the illness of suffering.

source: །ས་འདི་ཕྱོགས་སུ་ཕྱིན་པ་ལྷ་ཡི་བདག་པོར་འགྱུར།
en: “Those who have reached this bhūmi become lords of gods,

source: །འཕྲུལ་དགའི་དམ་པ་ལྷག་པའི་ང་རྒྱལ་སེལ་ལ་མཁས།
en: Sunirmitas, who are skilled in dispelling pride.

source: །ཡེ་ཤེས་ལམ་དང་ལྡན་པ་དེ་ནི་ཅི་རྩོམ་ཡང་།
en: Whatever they do through the path of wisdom

source: །ཉན་ཐོས་ལམ་ལས་འདས་ཏེ་བརྟན་ཞིང་མི་འཕྲོགས་པའོ།
en: Transcends the path of the śrāvakas, is stable, and cannot be taken away.

source: །བདེ་གཤེགས་སྲས་པོ་བརྩོན་འགྲུས་ལྡན་པ་འདོད་གྱུར་ན།
en: “These bodhisattvas, who are endowed with diligence,

source: །ཏིང་འཛིན་བྱེ་བ་བརྒྱ་སྟོང་ཚང་བ་ཐོབ་པར་བྱེད།
en: Wish to attain in one instant a trillion samādhis.

source: །སྐད་ཅིག་གཅིག་ཏུ་ཕྱོགས་བཅུར་སངས་རྒྱས་མང་པོ་ལྟ།
en: They see numerous buddhas in the ten directions,

source: །དཔྱིད་ཀྱི་ཉི་མ་གསལ་ཞིང་ལྷན་པར་བྱེད་པ་བཞིན།
en: Shining as brightly as the summer sun. “The jinaputras have taught The sixth bhūmi of the great beings,

source: །ཟབ་ཅིང་བལྟ་དཀའ་ཕྲ་བ་སྟེ།
en: Which is profound, difficult to see, subtle,

source: །ཉན་ཐོས་ང་རྒྱལ་ཤེས་མི་ནུས། །བདག་ཉིད་ཆེ་ལ་ས་དྲུག་པ། །རྒྱལ་བའི་སྲས་ཀྱིས་བཤད་པ་ཡིན།
en: And cannot be understood by the śrāvakas and pratyekabuddhas.

source: །མངོན་སུམ་པ་ཞེས་བྱ་བ་སྟེ།
en: “That which is named Manifested

source: བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པའོ།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅུ་བདུན་པ། །དེ་ནས་སྣ་ཚོགས་ཡིད་འོང་སྤྲིན།
en: Is the sixth bodhisattva bhūmi.”

source: །ལྷ་ཚོགས་མང་པོ་མཁའ་ལ་གནས་ཤིང་མངོན་པར་འཐོར།
en: The hosts of deities residing in the sky Scattered multicolored, beautiful clouds.

source: །ཚིག་སྙན་རྣམ་པར་བརྗོད་པ་བྱེད།
en: They spoke with beautiful words,

source: །དགའ་བའི་དམ་པ་མཆོག་གིས་ཡོངས་སུ་རྒྱས།
en: With complete sublime perfect joy : “Well done!

source: །དགེའོ་དོན་དམ་སེམས་མཛད་ཅིང་།
en: He has a perfect discerning mind,

source: །ཡོན་ཏན་བརྒྱ་དང་ཡང་དག་ལྡན་ཞིང་དབང་སྒྱུར་བ། །མི་ཡི་པུན་དཱ་རི་ཀ་ཡིན།
en: Possesses hundreds of qualities and the mastery of wisdom,

source: །འགྲོ་ལ་ཕན་པའི་སྤྱོད་རབ་ཡང་དག་བཤད།
en: And has the perfect conduct and bliss

source: །ཡིད་འོང་འོད་མཆོག་ལྡན་ཁྱོད་དང་། །མི་ཡི་གཙོ་བོ་མྱ་ངན་ཡོངས་སུ་སེལ་མཛད་ལ།
en: Of the perfect white lotus that benefits beings.”

source: །དབང་ཕྱུག་ཆེན་པོ་མཁའ་གནས་ཤིང་།
en: Then the great lords who dwell in the sky scattered Supreme unequaled light upon the supreme among men.

source: །སྤོས་སྤྲིན་ཡིད་འོང་དམ་པ་མངོན་པར་འཐོར།
en: They scattered supreme, beautiful clouds of incense On the lord of humans who removes the flow of kleśas.

source: །ཚིག་སྙན་རབ་ཏུ་བརྗོད་པ་བྱེད།
en: The host of gods spoke delightfully

source: །ལྷ་ཚོགས་མང་པོ་མཁའ་ལས་དགའ་འགྱུར་དབྱངས་སྒྲོག་ཅིང་།
en: With joyful, beautiful voices,

source: །གང་གིས་ས་བསྟན་འདི་ཐོས་པ།
en: Saying that those who had heard the teachings on the bhūmis

source: །དེ་དག་ཐོབ་པ་བཟང་པོ་ཐོབ་ཅེས་ཟེར། །རོལ་མོ་བརྡུང་དཀྲོལ་དབྱངས་སྙན་པ།
en: Had attained the highest attainment.

source: །བརྒྱ་མང་ལྷ་ཡི་བུ་མོས་དགའ་བར་བྱས།
en: The goddesses with delighted minds Played beautiful music combined with their beautiful voices,

source: །བདེ་བར་གཤེགས་དང་ཁྱོད་མཐུ་ཡིས།
en: And through the power of the Sugata’s excellent conduct

source: །ཚིག་རབ་འདི་འདྲ་རབ་ཏུ་བརྗོད་པར་འགྱུར།
en: They spoke in this way about the supreme conduct:

source: །ཞི་དང་ངེས་སྤྱོད་དམ་པ་ཅན།
en: “The wise, the most excellent in good conduct,

source: །མ་དུལ་འདུལ་མཛད་འཇིག་རྟེན་ཀུན་གྱིས་མཆོད་བྱས་པ།
en: Tamers of the well tamed, those honored by the world,

source: །འཇིག་རྟེན་ཀུན་ལས་འདས་པ་ཡི།
en: Who have transcended the entire world

source: །འཇིག་རྟེན་སྤྱོད་པ་ཤིན་ཏུ་ཕྲ་བ་བསྟན།
en: Yet act in the world, teaching that which is subtle—

source: །སྣ་ཚོགས་ལུས་ཀྱང་རབ་ཏུ་བསྟན།
en: “They manifest various bodies,

source: ལུས་དང་ལུས་ལ་ཆོས་ཉིད་ཕུན་སུམ་ཚོགས་ཤིང་ལྡན།
en: Each body abiding the true nature.

source: །རྣམ་དཔྱོད་ཞི་གནས་མཐུས་བཅིལ་བས།
en: Dwelling in peace, with divisions united,

source: །དབྱངས་སུ་སྒྲོག་ཀྱང་ཡི་གེ་བརྗོད་མི་བྱེད།
en: They speak without the sound of voice or syllables.

source: །ཞིང་རྣམས་བརྒྱར་ཡང་འདོད་བྱེད་ཅིང་།
en: “They go to hundreds of realms

source: །མགོན་པོ་མཆོད་པར་འོས་ལ་མཆོད་རབ་བྱེད།
en: And make offerings to the guides, who are most worthy of offering. They have the power of wisdom, dispelling

source: །ཞིང་རྒྱལ་བདག་ཏུ་འདུ་ཤེས་པ། །ཡེ་ཤེས་དབང་སྒྱུར་མཆོག་གིས་རབ་ཏུ་སེལ།
en: The conception that realms are produced by a self.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱེད་ཀྱང་།
en: “Even though they ripen beings,

source: །བདག་དང་གཞན་གྱི་འདུ་ཤེས་རྣམ་པ་ཀུན་ཏུ་མེད།
en: They have no conception of self and other.

source: །དགེ་བ་ཡངས་པ་ཡང་དག་སྩོགས།
en: They perfectly accumulate merit,

source: །འོན་ཀྱང་དགེ་བ་སྩོགས་ལ་གནས་པ་མེད།
en: But they do not dwell in the accumulation of merit.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་གིས། །འཇིག་རྟེན་ཐམས་ཅད་རབ་ཏུ་འབར་བར་མཐོང་གྱུར་ཅིང་།
en: “They see that all worlds are burning With anger, desire, and ignorance,

source: །འདུ་ཤེས་ཐམས་ཅད་རྣམ་སྤངས་ནས།
en: And they forsake all conceptualization,

source: །སྙིང་བརྩེ་ལྡན་པར་བརྩོན་འགྲུས་རབ་ཏུ་རྩོམ།
en: And with compassion are perfectly engaged in diligence.”

source: །ལྷ་མང་ལྷ་ཡི་བུ་མོ་ཡིས།
en: The multitude of gods and goddesses

source: །གསུང་བའི་མཆོག་ལ་མཆོད་བྱས་ནས།
en: Made offerings to the supreme speech,

source: །ཀུན་ཀྱང་མི་སྨྲ་དགར་གྱུར་ཏེ།
en: And all were overjoyed and silent

source: །དྲང་སྲོང་ཆེ་ལ་ལྟ་ཞིང་གནས།
en: And remained looking at the great sage.

source: །ཐར་བའི་ཟླ་བས་ཡང་སྨྲས་པ།
en: Then Vimukti­candra said, “The assembly is in a state of peace.

source: །འཁོར་རྣམས་ཤིན་ཏུ་རྣམ་པར་དང་། །ས་བདུན་པ་ཡི་རྣམ་པ་དག །རྒྱལ་བའི་སྲས་ཀྱིས་བཤད་པ་མཛོད།
en: Jinaputra, describe to us The nature of the seventh bhūmi.”

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པ་ལ་དེ་ལྟར་སའི་ལམ་ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་ཡོངས་སུ་གནོན་ཏོ།
en: The bodhisattva on the sixth bhūmi who has in that way completed the bhūmi’s path ascends to the seventh bodhisattva bhūmi.

source: །དེ་ཐབས་དང་ཤེས་རབ་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་ལམ་བརྩམ་པའི་ཁྱད་པར་བཅུས་ཡོངས་སུ་གནོན་ཏེ།
en: He ascends through the ten aspects of engagement in the path, which are accomplished through method and wisdom.

source: བཅུ་གང་ཞེ་ན།
en: “What are these ten?

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་བསྒོམས་པའི་ཡིད་དང་ཡང་ལྡན་ལ་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་ཡང་ཡང་དག་པར་སྩོགས་པ་ཡིན།
en: (1) He has a mind that meditates perfectly in the samādhis of emptiness, featurelessness, and aspirationlessness but wishes to complete a great accumulation of merit and wisdom.

source: །བདག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པའི་ཆོས་ལ་འང་རབ་ཏུ་འཇུག་ལ་ཚད་མེད་པ་བཞི་མངོན་པར་བསྒྲུབ་པ་ཡང་ཡོངས་སུ་མི་གཏོང་བ་ཡིན།
en: ) He comprehends the absence of a self, the absence of a soul, and the absence of a person in all phenomena, but never abandons accomplishing the four immeasurables.

source: བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་ཤིན་ཏུ་མཐོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པ་འང་མངོན་པར་སྒྲུབ་ལ། ཆོས་གང་ལ་འང་མངོན་པར་ཆགས་པ་མེད་པ་ཡིན།
en: (3) He accomplishes the accomplishment of the perfection of a high accumulation of merit but has no attachment toward any phenomenon.

source: ཁམས་གསུམ་པ་ལས་དབེན་པར་གྱུར་པའང་ཐོབ་ལ་ཁམས་གསུམ་པ་བསྡུ་བ་དང་། རྒྱན་མངོན་པར་བསྒྲུབ་པ་ཡིན།
en: (4) He attains detachment from the three realms but accomplishes the accomplishment of establishing himself as an adornment for the three realms.

source: ཉོན་མོངས་པ་འབར་བ་ཐམས་ཅད་ཤིན་ཏུ་ཞི་ཞིང་རབ་ཏུ་ཞི་སྟེ། ཉེ་བར་ཞི་བ་འང་ཡིན་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་དང་། ཉོན་མོངས་པའི་མེ་ལྕེ་རབ་ཏུ་ཞི་བར་མངོན་པར་བསྒྲུབ་པའང་མངོན་པར་སྒྲུབ་པ་ཡིན།
en: (5) He has the tranquility and absolute peace that comes from the fire of all the kleśas having gone out, but he accomplishes the accomplishment of extinguishing the fire of the kleśas of desire, anger, and ignorance in all beings.

source: སྒྱུ་མ་དང་རྨི་ལམ་དང་མིག་ཡོར་དང་། སྒྲ་བརྙན་དང་། ཆུའི་ཟླ་བ་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པའི་རང་བཞིན་ལྟ་བུར་ཡོད་པ་དང་། མེད་པ་དང་། གཉིས་ཀ་མ་ཡིན་པ་ཐམས་ཅད་ཀྱང་ཁོང་དུ་ཆུད་ལ། ལས་དང་བྱ་བ་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པའི་བསམ་པ་ཡང་མངོན་པར་སྒྲུབ་པ་ཡིན། ཞིང་གི་ཐ་གྲུ་ནམ་མཁའ་དང་མཉམ་པར་ཤིན་ཏུ་བསྒོམས་པའི་ཡིད་དང་ཡང་ལྡན་ལ།
en: (6) He realizes that like illusions, dreams, hallucinations, echoes, the moon on water, reflections, and apparitions, there is no duality of existence and nonexistence, but he accomplishes his aspiration for infinite distinct actions and activities.
